app/Controllers/Alumnos.php

SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `idrol` = '2'
SELECT COUNT(*) AS `numrows` FROM `alumnos`
---
    public function index()
    {
        $librosModel = new LibrosModel();
        $areasModel = new AreasconocimientoModel();
        $usuariosModel = new UsuariosModel();
        $alumnosModel = new AlumnosModel();
        $item= [
            'total_libros' => $librosModel->countAll(), // Contar total de libros
            'total_carreras' => $areasModel->countAll(), // Contar total de carreras
            'total_bibliotecarios' => $usuariosModel->where('idrol', '2')->countAllResults(), // Contar bibliotecarios
            'total_alumnos' => $alumnosModel->countAll() // Contar alumnos

SELECT *
FROM `roles`
---
    public function edit($id)
    {
        $alumnos= new AlumnosModel();
        $item['alumnos']= $alumnos->getIdAlumnosConRol($id);
        $roles= new RolesModel();
        $item['roles']=$roles->findAll();