app/Controllers/Usuarios.php

SELECT *
FROM `configuracion`
 LIMIT 1
---
    public function loginForm()
    {
        $configuracion= new ConfiguracionModel();
        $item['configuracion']= $configuracion->first();

SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `idrol` = '2'
SELECT COUNT(*) AS `numrows` FROM `alumnos`
---
    public function index()
    {
        $librosModel = new LibrosModel();
        $areasModel = new AreasconocimientoModel();
        $usuariosModel = new UsuariosModel();
        $alumnosModel = new AlumnosModel();
        $item= [
            'total_libros' => $librosModel->countAll(), // Contar total de libros
            'total_carreras' => $areasModel->countAll(), // Contar total de carreras
            'total_bibliotecarios' => $usuariosModel->where('idrol', '2')->countAllResults(), // Contar bibliotecarios
            'total_alumnos' => $alumnosModel->countAll() // Contar alumnos