app/Models/AlumnosModel.php

    public function getAlumnosConRol() {
        $cobranzaModel = $this->db->table('alumnos')
            ->join('roles', 'alumnos.idrol = roles.idrol')
            ->join('areaconocimiento', 'alumnos.idcarrera = areaconocimiento.idarea')
            ->select('alumnos.*, roles.nombrerol AS nombrerol, areaconocimiento.nombrearea AS carrera')
            ->get(); // Ejecuta la consulta
---
SELECT `alumnos`.*, `roles`.`nombrerol` AS `nombrerol`, `areaconocimiento`.`nombrearea` AS `carrera`
FROM `alumnos`
JOIN `roles` ON `alumnos`.`idrol` = `roles`.`idrol`
JOIN `areaconocimiento` ON `alumnos`.`idcarrera` = `areaconocimiento`.`idarea`

    public function getIdAlumnosConRol($id) {
        $cobranzaModel = $this->db->table('alumnos')
            ->where('idalumno',$id)
            ->join('roles', 'alumnos.idrol = roles.idrol')
            ->join('areaconocimiento', 'alumnos.idcarrera = areaconocimiento.idarea')
            ->select('alumnos.*, roles.nombrerol AS nombrerol, areaconocimiento.nombrearea AS carrera, areaconocimiento.idarea AS idarea')
            ->get(); // Ejecuta la consulta
---
SELECT `alumnos`.*, `roles`.`nombrerol` AS `nombrerol`, `areaconocimiento`.`nombrearea` AS `carrera`, `areaconocimiento`.`idarea` AS `idarea`
FROM `alumnos`
JOIN `roles` ON `alumnos`.`idrol` = `roles`.`idrol`
JOIN `areaconocimiento` ON `alumnos`.`idcarrera` = `areaconocimiento`.`idarea`
WHERE `idalumno` = '3'