app/Models/ConsultasModel.php

    public function obtener() {
        return $this->db->table('consulta')
            ->select('consulta.*, libros.*, alumnos.*, areaconocimiento.nombrearea as carrera')
            ->join('libros', 'consulta.idlibro = libros.idlibros')
            ->join('alumnos', 'consulta.idalumno = alumnos.idalumno')
            ->join('areaconocimiento', 'alumnos.idcarrera = areaconocimiento.idarea')
            ->get()
            ->getResult();
---
SELECT `consulta`.*, `libros`.*, `alumnos`.*, `areaconocimiento`.`nombrearea` as `carrera`
FROM `consulta`
JOIN `libros` ON `consulta`.`idlibro` = `libros`.`idlibros`
JOIN `alumnos` ON `consulta`.`idalumno` = `alumnos`.`idalumno`
JOIN `areaconocimiento` ON `alumnos`.`idcarrera` = `areaconocimiento`.`idarea`