app/Models/LibrosModel.php

    public function getLibrosConCarrera() {
        return $this->db->table('libros')
            ->select('libros.*, areaconocimiento.nombrearea AS carrera')
            ->join('areaconocimiento', 'libros.id_carrera = areaconocimiento.idarea')
            ->get()
            ->getResult();
---
SELECT `libros`.*, `areaconocimiento`.`nombrearea` AS `carrera`
FROM `libros`
JOIN `areaconocimiento` ON `libros`.`id_carrera` = `areaconocimiento`.`idarea`