app/Models/UsuariosModel.php

SELECT `usuarios`.*, `roles`.`nombrerol` AS `nombrerol`
FROM `usuarios`
JOIN `roles` ON `usuarios`.`idrol` = `roles`.`idrol`
---
    public function getUsuariosConRol() {
        $usuarioModel = $this->db->table('usuarios')
            ->join('roles', 'usuarios.idrol = roles.idrol')
            ->select('usuarios.*, roles.nombrerol AS nombrerol')
            ->get(); // Ejecuta la consulta